## Do You Know Python Has A Built-In Database?
- https://towardsdatascience.com/do-you-know-python-has-a-built-in-database-d553989c87bd

In [2]:
import sqlite3 as sq

In [3]:
conn = sq.connect('my-test.db')

In [7]:
with conn:
    conn.execute("""
        CREATE TABLE USER (
            id INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT,
            name TEXT,
            age INTEGER  
        );
    """)

In [8]:
sql = 'insert into USER (id, name, age) values(?, ?, ?)'
data = [
    (1, 'Alice', 21),
    (2, 'Bob', 22),
    (3, 'Chris', 23)
]

In [9]:
with conn:
    conn.executemany(sql, data)

In [10]:
with conn:
    data = conn.execute("select * from USER where age <= 22")
    for row in data:
        print(row)

(1, 'Alice', 21)
(2, 'Bob', 22)

In [12]:
import pandas as pd

In [15]:
df_skill = pd.DataFrame({
    'user_id': [1,1,2,2,3,3,3],
    'skill': ['Network Security', 'Algorithm Development', 'Network Security', 'Java', 'Python', 'Data Science', 'Machine Learning']
})
df_skill

   user_id                  skill
0        1       Network Security
1        1  Algorithm Development
2        2       Network Security
3        2                   Java
4        3                 Python
5        3           Data Science
6        3       Machine Learning

In [16]:
df_skill.to_sql('SKILL', conn)

In [18]:
df = pd.read_sql('''
    select s.user_id, u.name, u.age, s.skill 
    from USER u left join SKILL s on u.id = s.user_id
''', conn)

In [19]:
df

   user_id   name  age                  skill
0        1  Alice   21  Algorithm Development
1        1  Alice   21       Network Security
2        2    Bob   22                   Java
3        2    Bob   22       Network Security
4        3  Chris   23           Data Science
5        3  Chris   23       Machine Learning
6        3  Chris   23                 Python

In [21]:
df.to_sql('USER_SKILL', conn)